app/views/events/show.html.erb

SELECT  1 AS one FROM "entries" WHERE "entries"."end_user_id" = ? AND "entries"."event_id" = ? LIMIT ?  [["end_user_id", 1], ["event_id", 4], ["LIMIT", 1]]
---
  		<% if end_user_signed_in?  %>
  			<% if !Entry.exists?(end_user_id:current_end_user.id, event_id: @event.id) %>