app/controllers/end_users_controller.rb

  def index
    @end_user = EndUser.find(params[:id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

	def show
    @end_user = EndUser.find(params[:id])
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]