app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."end_user_id" = ?  [["end_user_id", 3]]
---
 def index
    @end_user = current_end_user
    @entries = Entry.where(end_user_id: @end_user.id).all

INSERT INTO "entries" ("end_user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["end_user_id", 3], ["event_id", 2], ["created_at", "2019-10-14 04:17:19.536219"], ["updated_at", "2019-10-14 04:17:19.536219"]]
---
 def create
   if Entry.create(end_user_id: @end_user.id,event_id: params[:format])

SELECT  "entries".* FROM "entries" WHERE "entries"."end_user_id" = ? AND "entries"."event_id" = ? LIMIT ?  [["end_user_id", 3], ["event_id", 2], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
 def destroy
   if entry = Entry.find_by(end_user_id: @end_user.id,event_id: params[:id] )
     entry.destroy