app/controllers/events_controller.rb

INSERT INTO "events" ("event_name", "event_image_id", "event_description", "event_date", "event_time", "event_fee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
    @event = Event.new(event_params)
    # @event.end_user_id = current_end_user.id
    @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "event_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_time", "2019-10-09 04:00:00"], ["updated_at", "2019-10-09 03:10:46.927661"], ["id", 3]]
---
  def update
  @event = Event.find(params[:id])
  @event.update(event_params)