app/controllers/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ?  [["LIMIT", 11]]
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('リーアム・ニーソン') OR LOWER(name) = LOWER('ロバート・デ・ニーロ'))
---
  def index
    if params[:q]
      render :index
    elsif params[:tag]
      @items = Item.tagged_with(params[:tag]).page(params[:page]).per(10)
    else
      @items = Item.all.page(params[:page]).per(10)

INSERT INTO "items" ("name", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ジョーカー"], ["release_date", "2019年10月04日"], ["created_at", "2019-10-05 08:03:19.592325"], ["updated_at", "2019-10-05 08:03:19.592325"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "7466f99cfefb6ca6dfa027b3012ef07255c95387661af946546cd1c57035"], ["updated_at", "2019-10-07 10:11:04.900893"], ["id", 2]]
---
  def update
    @item = Item.find(params[:id])
    respond_to do |format|
      if @item.update(item_params)