app/controllers/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if params[:tag]
      @items = Item.tagged_with(params[:tag])
    else
      @items = Item.all